Tekla Open API Reference for Tekla Structures 2025
ProfileItemParameter.AlblString Property
 Gets a translated albl string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string AlblString { get; }
Public ReadOnly Property AlblString As String
	Get
Property Value
Type: String
See Also
Reference
ProfileItemParameter Class
Tekla.Structures.Catalogs Namespace